// 2020년 1월 1일은 수요일
// 2020년 a월 b일은 무슨 요일?
// 입력 a, b
// 무슨 요일인지 return solution 함수 작성하기

// 제한 조건
// 2020년은 윤년이다. : 양력 2월이 29일까지 있는 해
// 2020년 a월 b일은 실제로 있는 날이다.

const year = parseInt(prompt('년도를 입력하세요.'), 10);
const a = parseInt(prompt('월을 입력하세요.'), 10);
const b = parseInt(prompt('일을 입력하세요.'), 10);

const day = ["SUN", "MON", "TUE", "WED", "THU", "FRI", "SAT"];

function leapYear(year) {
  let leap = false;
  if ((year % 4 === 0 && year % 100 !== 0) || year % 400 === 0) {
    leap = true;
  }
  console.log(solution(leap, year, a, b));
}

function solution(leap, y, a, b) {
  if (a > 12) {
    return "날짜는 12월까지만 입력 가능합니다.";
  }

  // 윤년체크해서 해당 일이 윤년일 경우 29일까지 있고
  // 해당 일이 윤년이 아닐 경우 28일까지 있다.
  if (leap === true){
      if (a === 2 && b > 29) {
          return `${y}년 2월은 29일까지 있습니다.`;
    }
  } else {
    if (a === 2 && b > 28) {
        return `${y}년 2월은 28일까지 있습니다.`;
    }
  }

  let date = new Date(`${y}-${a}-${b}`).getDay();
  let dayLabel = day[date];

  return dayLabel;
}

console.log(leapYear(year));


// ------------------------------------------------------

// 윤년 확인하기🌝
// 1. 연수가 4로 나누어 떨어지는 해
// 2. 100으로 나누어 떨어지는 해는 평년
// 3. 400으로 나누어 떨어지는 해는 윤년

// function leapYear(year) {
//     return ((year % 4 === 0) && (year % 100 !== 0)) || year % 400 === 0;
// }