// 이상한 369
// 3이나 6, 9 일 때만 박수를 쳐야한다.
// 36일 때 박수를 쳤다면 박수를 친 횟수는 5번
// n을 입력하면 박수를 몇 번 쳤는지 그 숫자를 출력하기

function solution(n) {
    let answer = 0;
    let count = 1;
    let rule = { 3: 1, 6: 2, 9: 3 };
  
    while (n.length !== 0) {
      answer += rule[parseInt(n.pop(), 10)] * count;
      count *= 3;
    }
  
    return answer;
}
  
const n = "93".split("");

console.log(solution(n));

// ------------------------------------------------------

// 식 만들어보기

// 3 -> 1
// 6 -> 2
// 9 -> 3
// 33 -> 1 + 1 * 3 == 4
// 36 -> 2 + 1 * 3 == 5
// 39 -> 3 + 1 * 3 == 6
// 63 -> 1 + 2 * 3 == 7
// 66 -> 2 + 2 * 3 == 8
// 69 -> 3 + 2 * 3 == 9
// 93 -> 1 + 3 * 3 == 10
// 96 -> 2 + 3 * 3 == 11
// 99 -> 3 + 3 * 3 == 12